experiments/results/logs/burst-hpa-004/wrk2.txt
Running 2m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 7110.492ms, rate sampling interval: 17498ms
  Thread calibration: mean lat.: 7107.543ms, rate sampling interval: 15654ms
  Thread calibration: mean lat.: 7072.890ms, rate sampling interval: 15917ms
  Thread calibration: mean lat.: 6952.632ms, rate sampling interval: 15294ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.96m    27.41s    1.75m    58.74%
    Req/Sec     3.12      0.32     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95m 
 75.000%    1.37m 
 90.000%    1.59m 
 99.000%    1.71m 
 99.900%    1.73m 
 99.990%    1.75m 
 99.999%    1.75m 
100.000%    1.75m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9388.031     0.000000            1         1.00
   19021.823     0.100000          161         1.11
   29687.807     0.200000          323         1.25
   39026.687     0.300000          483         1.43
   47874.047     0.400000          644         1.67
   56983.551     0.500000          804         2.00
   62586.879     0.550000          885         2.22
   67829.759     0.600000          968         2.50
   71958.527     0.650000         1046         2.86
   76546.047     0.700000         1125         3.33
   81985.535     0.750000         1206         4.00
   84344.831     0.775000         1247         4.44
   85524.479     0.800000         1286         5.00
   89260.031     0.825000         1330         5.71
   91291.647     0.850000         1368         6.67
   93716.479     0.875000         1407         8.00
   94896.127     0.887500         1428         8.89
   95485.951     0.900000         1448        10.00
   96141.311     0.912500         1468        11.43
   97189.887     0.925000         1487        13.33
   99221.503     0.937500         1507        16.00
  100270.079     0.943750         1517        17.78
  100532.223     0.950000         1528        20.00
  100728.831     0.956250         1539        22.86
  100925.439     0.962500         1548        26.67
  101384.191     0.968750         1558        32.00
  101580.799     0.971875         1563        35.56
  101711.871     0.975000         1569        40.00
  101908.479     0.978125         1574        45.71
  101974.015     0.981250         1577        53.33
  102301.695     0.984375         1582        64.00
  102367.231     0.985938         1585        71.11
  102432.767     0.987500         1587        80.00
  102629.375     0.989062         1590        91.43
  102760.447     0.990625         1592       106.67
  102957.055     0.992188         1597       128.00
  102957.055     0.992969         1597       142.22
  102957.055     0.993750         1597       160.00
  103415.807     0.994531         1599       182.86
  103612.415     0.995313         1600       213.33
  103743.487     0.996094         1601       256.00
  103809.023     0.996484         1603       284.44
  103809.023     0.996875         1603       320.00
  103809.023     0.997266         1603       365.71
  103940.095     0.997656         1604       426.67
  103940.095     0.998047         1604       512.00
  104005.631     0.998242         1605       568.89
  104005.631     0.998437         1605       640.00
  104005.631     0.998633         1605       731.43
  104071.167     0.998828         1606       853.33
  104071.167     0.999023         1606      1024.00
  104071.167     0.999121         1606      1137.78
  104071.167     0.999219         1606      1280.00
  104071.167     0.999316         1606      1462.86
  104988.671     0.999414         1607      1706.67
  104988.671     1.000000         1607          inf
#[Mean    =    57708.789, StdDeviation   =    27412.492]
#[Max     =   104923.136, Total count    =         1607]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1709 requests in 2.00m, 17.55MB read
  Socket errors: connect 0, read 0, write 0, timeout 4263
Requests/sec:     14.22
Transfer/sec:    149.59KB